# Homebrew packages for macOS (run via: brew bundle install --file=Brewfile)

# CLI tools
brew "go"
brew "git"
brew "curl"
brew "wget"
brew "jq"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "fzf"
brew "htop"
brew "mcpjungle/mcpjungle/mcpjungle"  # Self-hosted MCP gateway for AI agents (https://github.com/mcpjungle/MCPJungle)

# TUIs (terminal user interfaces)
brew "lazygit"   # Git: stage, commit, branches, rebase, etc.
brew "btop"     # System monitor (CPU, memory, disk, network)
brew "ncdu"     # Disk usage explorer
brew "nnn"      # Fast file manager
brew "lazydocker" # Docker containers, images, logs
brew "k9s"        # Kubernetes TUI: pods, logs, exec, etc.
brew "kubectl"    # Kubernetes CLI
brew "gurk"       # Signal Messenger TUI (https://github.com/boxdot/gurk-rs)
brew "mutt"       # Email client (https://gitlab.com/muttmua/mutt)
brew "tuisky"     # Bluesky TUI (https://github.com/sugyan/tuisky)
brew "wifitui"    # WiFi TUI (https://github.com/shazow/wifitui)

# # browsh (text-based browser). Requires up-to-date Xcode Command Line Tools.
# tap "browsh-org/browsh"
# brew "browsh-org/browsh/browsh"   # https://github.com/browsh-org/browsh

# Nerd Font
cask "font-jetbrains-mono-nerd-font"
